Repository: drangovski/billtray
Catalog: locale/*/LC_MESSAGES/django.po
Languages: mk

source: English
mk: Англиски

source: Macedonian
mk: Македонски

source: Dashboard
mk: Контролна табла

source: Billing Overview
mk: Платежен преглед

source: Billing Types
mk: Видови на сметки

source: Settings
mk: Прилагодувања

source: Household overview for the current month
mk: Преглед на домаќинството за овој месец

source: Total amount paid
mk: Вкупна платена сума

source: Total due amount remaining
mk: Преостаната тековна сума

source: Amount overdue
mk: Задоцнета сума

source: Due bills
mk: Тековни сметки

source: Overdue bills
mk: Задоцнети сметки

source: Paid bills
mk: Платени сметки

source: Missing bills
mk: Пропуштени сметки
